openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
/* -------------------------------- Arctic Core ------------------------------
 * Arctic Core - the open source AUTOSAR platform http://arccore.com
 *
 * Copyright (C) 2009  ArcCore AB <contact@arccore.com>
 *
 * This source code is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License version 2 as published by the
 * Free Software Foundation; See <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
 * or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
 * for more details.
 * -------------------------------- Arctic Core ------------------------------*/

/** @reqSettings DEFAULT_SPECIFICATION_REVISION=3.1.5 */

/* ----------------------------[information]----------------------------------*/
/*
 * Author: mahi
 *
 * Part of Release:
 *   3.1.5
 *
 * Description:
 *   Implements the Can Driver module
 *
 * Support:
 *   General                  Have Support
 *   -------------------------------------------
 *   CAN_DEV_ERROR_DETECT            Y
 *   CAN_HW_TRANSMIT_CANCELLATION    N
 *   CAN_IDENTICAL_ID_CANCELLATION   N
 *   CAN_INDEX                       N
 *   CAN_MULTIPLEXED_TRANSMISSION    N
 *   CAN_TIMEOUT_DURATION            N
 *   CAN_VERSION_INFO_API            N
 *
 *   Controller                  Have Support
 *   -------------------------------------------
 *   CAN_BUSOFF_PROCESSING           N  , Interrupt only
 *   CAN_RX_PROCESSING               N  , Interrupt only
 *   CAN_TX_PROCESSING               N  , Interrupt only
 *   CAN_WAKEUP_PROCESSING           N  , Interrupt only
 *   CAN_CPU_CLOCK_REFERENCE         N  , Not selectable ( in Studio? )
 *   CanWakeupSourceRef              N  , Not selectable ( in Studio? )
 *
 * Devices
 *   MPC560x
 *   MPC551x
 *   MPC5567
 *   MPC5668
 *
 *   MPC5554 is NOT supported (no individual mask)
 *
 * Implementation Notes:
 *   - Individual RXMASKs are always ON. No support for "old" chips.
 *   FIFO
 *   - Is always ON.
 *   - Is masked ONLY against 8 extended IDs
 *   - Have depth 6, with 8 ID and 8 RXMASK
 *
 *   MBOX ALLOCATION
 *     RX
 *       - First 8 boxes always allocated for RX FIFO
 *       - software filter for RX FIFO, to identify the right HRH.
 *       - HRHs are global indexed from 00
 *     TX
 *       - One HTH for each HOH (the HOH can have a number of mailboxes, in sequence)
 *       - HTHs are global (at least for each driver) indexed from 0
 *
 *    EXAMPLE ALLOCATION
 *      0 ,
 *      1  |
 *      2  |
 *      3  |   RX FIFO -> software lookup to map to right HTH
 *      4  |              1 FULL_CAN    HOH_0
 *      5  |              1 BASIC_CAN   HOH_1
 *      6  |
 *      7 ´
 *
 *      8   RX FULL_CAN  -  HOH_2
 *      9   RX FULL_CAN  -  HOH_3
 *      10  RX BASIC_CAN  - HOH_4   |  RX with 2 boxes
 *      11                - HOH_4   |
 *      12  TX FULL_CAN   - HOH_5
 *      13  TX BASIC_CAN  - HOH_6   |  TX with 2 boxes
 *      14                - HOH_6   |
 *
 *    LOOKUP
 *      TX
 *        Can_Write(..) sends with HTH as argument. We need find the HOH first
 *        and then find one or more TX mailboxes.
 *      RX
 *        TODO.
 *
 *
 *  OBJECT MODEL
 *
 *     Can_ControllerConfigType
 *     |--- Can_Arc_Hoh -->  CanHardwareObjectConfig_CTRL_A
 *
 *     CanHardwareObjectConfig_CTRL_A
 *     |--- CanObjectId
 *
 *
 *
 * Things left:
 *   All tags. Tags only on public functions now.
 *
 */

#include "Can.h"

//#include "ip_flexcan.h"
#include <stdio.h>
#include "mpc55xx.h"
#include "Cpu.h"
#include "Mcu.h"
#include "CanIf_Cbk.h"
#include "Det.h"
#if defined(USE_DEM)
#include "Dem.h"
#endif
#include <assert.h>
#include <stdlib.h>
#include <string.h>
#include "Os.h"
#include "isr.h"
#include "irq.h"
#include "arc.h"

/* CONFIGURATION NOTES
 * ------------------------------------------------------------------
 * - CanHandleType must be CAN_ARC_HANDLE_TYPE_BASIC
 *   i.e. CanHandleType=CAN_ARC_HANDLE_TYPE_FULL NOT supported
 *   i.e CanIdValue is NOT supported
 * - All CanXXXProcessing must be CAN_ARC_PROCESS_TYPE_INTERRUPT
 *   ie CAN_ARC_PROCESS_TYPE_POLLED not supported
 * - To select the Mailboxes to use in the CAN controller use Can_Arc_MbMask
 * - HOH's for Tx are global and Rx are for each controller
 * - CanControllerTimeQuanta is NOT used. The other CanControllerXXX selects
 *   the proper time-quanta
 * - Can_Arc_MbMask for Tx HOH must NOT overlap Can_Arc_MbMask for Rx.
 * - ONLY global mask is supported( NOT 14,15 and individual )
 * - Numbering the CanObjectId for Tx:
 *     To do this correctly there are a number of things that are good to know
 *     1. HTH's have unique numbers.
 *     2. One HTH/HRH is maped to one HOH
 *     3. The extension Can_Arc_MbMask binds FULL CAN boxes together.
 *
 *     Example:
 *
 *     HTH   B/F C  HOH
 *     ---------------------
 *      0    F   0  0
 *      1    F   0  1
 *      ..
 *      16   B   0  16  |
 *                  17  |    The use of Can_Arc_MbMask=0x000f0000 binds these to HTH 16
 *                  18  |    ( bits 16 to 19 set here )
 *                  19  |
 *           ...
 *      32   ... 1  32
 *
 *
 *        B - BASIC CAN
 *        F - FULL CAN
 *        C - Controller number
 *
 */

/* IMPLEMENTATION NOTES
 * -----------------------------------------------
 * - A HOH us unique for a controller( not a config-set )
 * - Hrh's are numbered for each controller from 0
 * - HOH is numbered for each controller in sequences of 0-31
 *   ( since we have 6 controllers and Hth is only uint8( See Can_Write() proto )
 * - loopback in HW NOT supported
 * - 32 of 64 boxes supported ( limited by Hth type )
 */

/* ABBREVATIONS
 *  -----------------------------------------------
 * - Can Hardware unit - One or multiple Can controllers of the same type.
 * - Hrh - HOH with receive definitions
 * - Hth - HOH with transmit definitions
 *
 */

/* HW INFO
 * ------------------------------------------------------------------
 *   This controller should really be called FlexCan+ or something because
 *   it's enhanced with:
 *   - A RX Fifo !!!!! ( yep, it's fantastic ;) )
 *   - A better matching process. From 25.4.4
 *   "By programming	more than one MB with the same ID, received messages will
 *    be queued into the MBs. The CPU can examine the time stamp field of the
 *    MBs to determine the order in which the messages arrived."
 *
 *   Soo, now it seems that Freescale have finally done something right.
 */

//-------------------------------------------------------------------

