openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
// Number of mailboxes used for each controller ( power of 2 only )
#define MAX_NUM_OF_MAILBOXES 64

#define GET_CONTROLLER(_controller) 	\
        					((struct FLEXCAN_tag *)(0xFFFC0000 + 0x4000*(_controller)))

#define GET_CONTROLLER_CONFIG(_controller)	\
        					&Can_Global.config->CanConfigSet->CanController[(_controller)]

#define GET_CALLBACKS() \
							(Can_Global.config->CanConfigSet->CanCallbacks)

#define CTRL_TO_UNIT_PTR(_controller) &CanUnit[Can_CtrlToUnitMap[_controller]]

#define GET_CONTROLLER_CNT() (CAN_CONTROLLER_CNT)

#define VALID_CONTROLLER(_ctrl)  (Can_Global.configured & (1<<(_ctrl)))




#define INSTALL_HANDLER4(_name, _can_entry, _vector, _priority, _app)\
	do { \
		ISR_INSTALL_ISR2(_name, _can_entry, _vector+0, _priority, _app); \
		ISR_INSTALL_ISR2(_name, _can_entry, _vector+1, _priority, _app); \
		ISR_INSTALL_ISR2(_name, _can_entry, _vector+2, _priority, _app); \
		ISR_INSTALL_ISR2(_name, _can_entry, _vector+3, _priority, _app); \
	} while(0)

#define INSTALL_HANDLER16(_name, _can_entry, _vector, _priority, _app)\
	do { \
		INSTALL_HANDLER4(_name, _can_entry, _vector+0, _priority, _app); \
		INSTALL_HANDLER4(_name, _can_entry, _vector+4, _priority, _app); \
		INSTALL_HANDLER4(_name, _can_entry, _vector+8, _priority, _app); \
		INSTALL_HANDLER4(_name, _can_entry, _vector+12,_priority, _app); \
	} while(0)

//-------------------------------------------------------------------

#if ( CAN_DEV_ERROR_DETECT == STD_ON )
#define VALIDATE(_exp,_api,_err ) \
        if( !(_exp) ) { \
          Det_ReportError(MODULE_ID_CAN,0,_api,_err); \
          return CAN_NOT_OK; \
        }

#define VALIDATE_NO_RV(_exp,_api,_err ) \
        if( !(_exp) ) { \
          Det_ReportError(MODULE_ID_CAN,0,_api,_err); \
          return; \
        }

#define DET_REPORTERROR(_x,_y,_z,_q) Det_ReportError(_x, _y, _z, _q)
#else
#define VALIDATE(_exp,_api,_err )
#define VALIDATE_NO_RV(_exp,_api,_err )
#define DET_REPORTERROR(_x,_y,_z,_q)
#endif

#if defined(USE_DEM)
#define VALIDATE_DEM_NO_RV(_exp,_err ) \
        if( !(_exp) ) { \
          Dem_ReportErrorStatus(_err, DEM_EVENT_STATUS_FAILED); \
          return; \
        }
#else
#define VALIDATE_DEM_NO_RV(_exp,_err )
#endif


//-------------------------------------------------------------------

// Message box status defines
#define MB_TX_ONCE		0xc
#define MB_INACTIVE	0x8
#define MB_RX				0x4
#define MB_ABORT			0x9

//-------------------------------------------------------------------
typedef enum {
    CAN_UNINIT = 0, CAN_READY
} Can_DriverStateType;

typedef union {
    vuint32_t R;
    struct {
        vuint32_t :14;
        vuint32_t TWRNINT :1;
        vuint32_t RWRNINT :1;
        vuint32_t BIT1ERR :1;
        vuint32_t BIT0ERR :1;
        vuint32_t ACKERR :1;
        vuint32_t CRCERR :1;
        vuint32_t FRMERR :1;
        vuint32_t STFERR :1;
        vuint32_t TXWRN :1;
        vuint32_t RXWRN :1;
        vuint32_t IDLE :1;
        vuint32_t TXRX :1;
        vuint32_t FLTCONF :2;
        vuint32_t :1;
        vuint32_t BOFFINT :1;
        vuint32_t ERRINT :1;
        vuint32_t WAKINT :1;
    } B;
} ESRType; /* Error and Status Register */

typedef struct FLEXCAN_tag flexcan_t;

// Mapping between HRH and Controller//HOH
typedef struct Can_Arc_ObjectHOHMapStruct {
    uint32 HxHRef; // Reference to HRH or HTH
    CanControllerIdType CanControllerRef; // Reference to controller
    const Can_HardwareObjectType* CanHOHRef; // Reference to HOH.
} Can_Arc_ObjectHOHMapType;

/* Type for holding global information used by the driver */
typedef struct {
    Can_DriverStateType initRun;

    // Our config
    const Can_ConfigType *config;

    // One bit for each channel that is configured.
    // Used to determine if validity of a channel
    // 1 - configured
    // 0 - NOT configured
    uint32 configured;
    // Maps the a channel id to a configured channel id
//    uint8 channelMap[CAN_CONTROLLER_CNT];

    // This is a map that maps the HTH:s with the controller and Hoh. It is built
    // during Can_Init and is used to make things faster during a transmit.
    Can_Arc_ObjectHOHMapType CanHTHMap[NUM_OF_HTHS];
} Can_GlobalType;


// Global config
Can_GlobalType Can_Global = { .initRun = CAN_UNINIT, };

/* Type for holding information about each controller */
typedef struct {
    /* This unit have uses controller */
    CanControllerIdType controllerId;

    CanIf_ControllerModeType state;
    uint32 lock_cnt;

    uint64 Can_Arc_RxMbMask;
    uint64 Can_Arc_TxMbMask;

    uint64 mbTxFree;

    uint8_t mbMax;     // Maximum number of used MB for this controller

    // Statistics
    Can_Arc_StatisticsType stats;

    // Data stored for Txconfirmation callbacks to CanIf
    PduIdType swPduHandles[MAX_NUM_OF_MAILBOXES];

    uint8_t mbToHrh[MAX_NUM_OF_MAILBOXES];

    /* List of controllers */
    const Can_ControllerConfigType *cfgCtrlPtr;

    /* List of HOHs */
    const Can_HardwareObjectType  *cfgHohPtr;
    flexcan_t *hwPtr;
} Can_UnitType;

Can_UnitType CanUnit[CAN_ARC_CTRL_CONFIG_CNT];

/* Used by ISR */
uint8_t Can_CtrlToUnitMap[CAN_ARC_CTRL_CONFIG_CNT];

/* Used by Can_Write() */
uint8_t Can_HthToUnitIdMap[NUM_OF_HTHS];
uint8_t Can_HthToHohMap[NUM_OF_HTHS];


static void clearMbFlag( flexcan_t * hw,  uint8_t mb ) {
    if( mb >= 32) {
        hw->IFRH.R = (1<<(32-mb));
    } else {
        hw->IFRL.R = (1<<mb);
    }
}

//-------------------------------------------------------------------

static inline uint64_t ilog2_64( uint64_t val ) {
    uint32_t t = val >> 32;

    if( t != 0) {
        return ilog2(t) + 32;
    }
    return ilog2((uint32_t)val);
}


//-------------------------------------------------------------------

static void Can_Isr(int unit);
static void Can_Err(int unit);
static void Can_BusOff(int unit);

void Can_A_Isr(void)
{
    Can_Isr(CAN_CTRL_A);
}
void Can_B_Isr(void)
{
    Can_Isr(CAN_CTRL_B);
}
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5567) || defined(CFG_MPC5668)
void Can_C_Isr( void ) {Can_Isr(CAN_CTRL_C);}
void Can_D_Isr( void ) {Can_Isr(CAN_CTRL_D);}
void Can_E_Isr( void ) {Can_Isr(CAN_CTRL_E);}
#endif
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5668)
void Can_F_Isr( void ) {Can_Isr(CAN_CTRL_F);}
#endif

void Can_A_Err(void)
{
    Can_Err(CAN_CTRL_A);
}
void Can_B_Err(void)
{
    Can_Err(CAN_CTRL_B);
}
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5567) || defined(CFG_MPC5668)
void Can_C_Err( void ) {Can_Err(CAN_CTRL_C);}
void Can_D_Err( void ) {Can_Err(CAN_CTRL_D);}
void Can_E_Err( void ) {Can_Err(CAN_CTRL_E);}
#endif
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5668)
void Can_F_Err( void ) {Can_Err(CAN_CTRL_F);}
#endif

void Can_A_BusOff(void)
{
    Can_BusOff(CAN_CTRL_A);
}
void Can_B_BusOff(void)
{
    Can_BusOff(CAN_CTRL_B);
}
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5567) || defined(CFG_MPC5668)
void Can_C_BusOff( void ) {Can_BusOff(CAN_CTRL_C);}
void Can_D_BusOff( void ) {Can_BusOff(CAN_CTRL_D);}
void Can_E_BusOff( void ) {Can_BusOff(CAN_CTRL_E);}
#endif
#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5668)
void Can_F_BusOff( void ) {Can_BusOff(CAN_CTRL_F);}
#endif
//-------------------------------------------------------------------


/**
 * Hardware error ISR for CAN
 *
 * @param unit CAN controller number( from 0 )
 */

static void Can_Err(int unit)
{
    flexcan_t *canHw = GET_CONTROLLER(unit);
    Can_Arc_ErrorType err;
    ESRType esr;
    const ESRType esrWrite = { .B.ERRINT = 1 };
    err.R = 0;

    /* Clear bits 16-23 by read */
    esr.R = canHw->ESR.R;

    if (GET_CALLBACKS()->Arc_Error != NULL) {
        GET_CALLBACKS()->Arc_Error(unit, err);
    }

    /* TODO: To avoid flooding the CPU with errors some intelligent
     * decisions have to be made here. CanSM should handle this.
     * (not implemented)
     *
     * So, turn the interrupts OFF.
     */
    canHw->CR.B.ERRMSK = 0;

    // Clear ERRINT
    canHw->ESR.R = esrWrite.R;
}

/**
 *
 * @param canHw
 * @param canUnit
 */
// Uses 25.4.5.1 Transmission Abort Mechanism
static void Can_AbortTx(flexcan_t *canHw, Can_UnitType *canUnit)
{
    uint32 mbMask;
    uint8 mbNr;

